export default function ExampleUI(props){

    return(
        <>
            {/* <div>00페이지</div> */}
            <div>{props.isEdit ? "수정페이지" : "등록페이지"} </div>
            제목: <input type="text" /><br/>
            내용: <input type="text" /><br/>
            <button>{props.isEdit ? "수정하기" : "등록하기"}</button>
        </>
    )
}


// 3. 리턴에 공통된 레이아웃 가져다가 붙이기
// 3-1. 공통된 내용 잠시 비워두기
// 3-2. 뉴와 에딧에 임포트해서 사용할 예정 (4.내용은 이그잼플뉴 인덱스)

// 7-2. (컨테이너에 앞선 설명) ~ 엑스포트의 이그잼플 유아이에 프롭스를 받아준다.
// 7-3. 이그잼플 유아이의 프롭스에 트루값이 오면 또는 펄스값이 오면 이므로
// 7-4. 상황에 따라 페이지의 이름이 바뀌어야하므로 삼항연산자 사용해서 00페이지의 이름이 바뀌게 해준다. (삼항연산자 필수 x / 조건부 렌더링도 가능)
// 7-5. <div>{props.isEdit ? "수정페이지" : "등록페이지"} </div>
// 7-6. 프롭스의 에딧값이 트루이면 수정페이지 / 펄스이면 등록페이지로 보이게 함

// 8. 버튼도 이즈에딧에 따라 문구가 바뀌어야하므로 삼항연산자와 이즈에딧을 활용해주기
// 8-1. <button>{props.isEdit ? "수정하기" : "등록하기"}</button> (9.내용은 이그잼플뉴페이지 인덱스)